telespial/EdgeAI_Package_Transport_Adaptive_Reasoning_demo_NXP_FRDM-MCXN947/sdk_example/mcuxsdk_examples_overlay/_boards/frdmmcxn947/demo_apps/edgeai_package_transport_anomaly_demo/cm33_core0/hardware_init.c
/*
 * Hardware init for EdgeAI Sand Demo (FRDM-MCXN947, cm33_core0).
 */

#include "pin_mux.h"
#include "clock_config.h"
#include "board.h"
#include "fsl_clock.h"

void BOARD_InitHardware(void)
{
    /* Debug console: FLEXCOMM4 */
    CLOCK_SetClkDiv(kCLOCK_DivFlexcom4Clk, 1u);
    CLOCK_AttachClk(BOARD_DEBUG_UART_CLK_ATTACH);

    /* Arduino I2C: FLEXCOMM2 */
    CLOCK_SetClkDiv(kCLOCK_DivFlexcom2Clk, 1u);
    CLOCK_AttachClk(kFRO12M_to_FLEXCOMM2);

    /* mikroBUS I2C: FLEXCOMM3 */
    CLOCK_SetClkDiv(kCLOCK_DivFlexcom3Clk, 1u);
    CLOCK_AttachClk(kFRO12M_to_FLEXCOMM3);

    /* On-board temp sensor bus: I3C1 */
    CLOCK_SetClkDiv(kCLOCK_DivI3c1FClk, 6u);
    CLOCK_AttachClk(kPLL0_to_I3C1FCLK);
    CLOCK_SetClkDiv(kCLOCK_DivI3c0FClkStc, 1u);
    CLOCK_AttachClk(kCLK_1M_to_I3C0FCLKSTC);
    CLOCK_SetClkDiv(kCLOCK_DivI3c0FClkS, 1u);
    CLOCK_AttachClk(kCLK_1M_to_I3C0FCLKS);

    /* LCD (FlexIO0, PAR-LCD-S035 shield) */
    CLOCK_SetClkDiv(kCLOCK_DivFlexioClk, 1u);
    CLOCK_AttachClk(kPLL0_to_FLEXIO);

    /* External NOR flash (W25Q64) on FLEXSPI0 */
    CLOCK_SetClkDiv(kCLOCK_DivFlexspiClk, 1u);
    CLOCK_AttachClk(kFRO_HF_to_FLEXSPI);

    BOARD_InitBootPins();
    BOARD_InitBootClocks();
    BOARD_InitDebugConsole();
}
